<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<h2>Тлумачальны слоўнік</h2>
<h4>Пастаноўка задачы:</h4>
<p><b>Ёсць тлумачальны слоўнік. Па спалучэнні літар выдаць усе словы, дзе яны сустракаюцца, і іх расшыфроўкі.</b> <i>(Варыянт: 6 з 14, нумар у групе: 20)</i></p>
<p>Стварыць web-прыкладанне з выкарыстаннем тэхналогіі Struts. Уваход у прыкладанне ажыццяўляецца пасродкам уводу імя і пароля. Рэалізаваць дзве групы карыстачоў: admins (могуць усё, у т.л. вырабляць аперацыі з карыстачамі) і users (абмежаваны ў магчымасцях, маюць доступ толькі да свайго ўліковага запісу). Апрацоўваць памылкі валідацыі з дапамогай Struts. Забяспечыць інтэрнацыяналізацыю. Прапанаваць прыстойны інтэрфейс карыстача (меню і да т.п.).</p>
<h4>Апісанне пабудаванага рашэння:</h4>
<p>Рэалізаванае прыкладанне мае наступныя магчымасці:</p>
<ul>
	<li>зручная праца са слоўнікам: пошук, сартаванне, пагінацыя;</li>
	<li>магчымасць дадання, рэдагавання і выдалення слоў;</li>
	<li>рэгістрацыя і аўтэнтыфікацыя карыстачоў;</li>
	<li>аўтарызацыя карыстачоў і правы доступу;</li>
	<li>мэнэджмент карыстачоў: прызначэнне роляў, заданне пароля, выдаленне;</li>
	<li>інтэрнацыяналізацыя: падтрымліваюцца беларуская, ангельская і руская мовы.</li>
</ul>
<p>У прыкладанні выкарыстоўваюцца наступныя тэхналогіі і праграмныя прадукты:</p>
<ul>
	<li>Java&trade; &mdash; мова праграмавання, на якой распрацавана прыкладанне;</li>
	<li>Apache Struts 2&trade; &mdash; фрэймворк для стварэння Java EE вэб-прыкладанняў на якім распрацавана прыкладанне;</li>
	<li>Apache Maven&trade; &mdash; для спрашчэння працэсу зборкі прыкладання і разбіцця яго на модулі;</li>
	<li>MySQL Server&trade; &mdash; выкарыстоўваецца ў якасці базы дадзеных для захоўвання слоўніка і карыстачоў;</li>
	<li>Twitter Bootstrap&trade; &mdash; для стварэння прыстойнага інтэрфейсу карыстача;</li>
	<li>А таксама Struts 2 Bootstrap Plugin, Struts 2 Json Plugin, бібліятэкі XStream і Apache Commons DBCP.</li>
</ul>
<p>Падчас распрацоўкі таксама выкарыстоўвалася Eclipse IDE, Jetty Web Server і githib.com. </p>
<p>Усе задзейнічаныя ў рэалізацыі тэхналогіі распаўсюджваюцца пад ліцэнзіямі Apache License 2.0 і BSD, што не накладвае ніякіх абмежаванняў на распрацаваны прадукт.</p>
<p>Зыходны код прыкладання можна знайсці ў рэпазітары <a href="https://github.com/paulenka-aleh/wordbook">https://github.com/paulenka-aleh/wordbook</a>.</p>